app/controllers/emails_controller.rb

SELECT * FROM "emails"
---
  def index
    @emails = Email.all

SELECT * FROM "emails" WHERE ("emails"."id" = 1)
UPDATE "emails" SET "response_id" = 1, "updated_at" = '2009-02-04 19:08:05' WHERE "id" = 3
---
  def update
    @email = Email.find params[:id]
    if @email.update_attributes params[:email]